#### All About Pandas

In [1]:
import numpy as np
import pandas as pd

In [4]:
user_data = {
    "Marks1" : np.random.randint(1,100,5),
    "Marks2" : np.random.randint(1,100,5),
    "Marks3" : np.random.randint(1,100,5),
}

In [5]:
print(user_data)

{'Marks1': array([59, 89, 98, 20, 32]), 'Marks2': array([54, 38, 71, 15, 58]), 'Marks3': array([19,  6, 79, 89, 13])}

In [9]:
# Will convert this raw data to data table
df = pd.DataFrame(user_data)

In [48]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [49]:
print(df.shape)

(5, 3)

In [8]:
print(df)

   Marks1  Marks2  Marks3
0      59      54      19
1      89      38       6
2      98      71      79
3      20      15      89
4      32      58      13

In [11]:
# Print DF in a better manner
df.head()

   Marks1  Marks2  Marks3
0      59      54      19
1      89      38       6
2      98      71      79
3      20      15      89
4      32      58      13

In [13]:
# Will print 3 rows
df.head(3)

   Marks1  Marks2  Marks3
0      59      54      19
1      89      38       6
2      98      71      79

In [16]:
# Columns of DF
df.columns

Index(['Marks1', 'Marks2', 'Marks3'], dtype='object')

In [18]:
df.to_csv("Marks.csv")

In [21]:
# Will read your CSV file
new_data = pd.read_csv("Marks.csv")

In [22]:
print(new_data)

   Unnamed: 0  Marks1  Marks2  Marks3
0           0      59      54      19
1           1      89      38       6
2           2      98      71      79
3           3      20      15      89
4           4      32      58      13

In [25]:
new_data = new_data.drop(columns = ['Unnamed: 0'])

In [26]:
print(new_data)

   Marks1  Marks2  Marks3
0      59      54      19
1      89      38       6
2      98      71      79
3      20      15      89
4      32      58      13

In [31]:
# slicing through passing row index , column index
df.iloc[1:5 ,1:2 ]

   Marks2
1      38
2      71
3      15
4      58

In [37]:
# Will print all statistic data about df
info = df.describe()
print(info)

          Marks1     Marks2     Marks3
count   5.000000   5.000000   5.000000
mean   59.600000  47.200000  41.200000
std    34.165772  21.510463  39.499367
min    20.000000  15.000000   6.000000
25%    32.000000  38.000000  13.000000
50%    59.000000  54.000000  19.000000
75%    89.000000  58.000000  79.000000
max    98.000000  71.000000  89.000000

In [34]:
df.iloc[3]

Marks1    20
Marks2    15
Marks3    89
Name: 3, dtype: int32

In [42]:
# Will print mean of all data sets
info.iloc[1]

Marks1    59.6
Marks2    47.2
Marks3    41.2
Name: mean, dtype: float64

In [43]:
print(new_data)

   Marks1  Marks2  Marks3
0      59      54      19
1      89      38       6
2      98      71      79
3      20      15      89
4      32      58      13

In [50]:
print(type(new_data))

<class 'pandas.core.frame.DataFrame'>